[
  {
    "permalink": "https://x.com/AOC/status/1799095276382085488",
    "datetime": "2024-06-07T15:05:14.000Z",
    "text": "The cynics will tell you that one vote won’t change anything.\n\nBut what they don’t tell you is that nothing can change without a vote.\n\nThe truth is, the world doesn’t belong to the cynics. It’s up to us.\n\nNew York: It’s time to vote.\nTuesday, June 25th.\n\nSpread the word.",
    "subtext": null,
    "has_video": true,
    "image_count": 0,
    "answers": 46082,
    "reposts": 7466,
    "likes": 31094,
    "saves": 1574,
    "views": 16477239,
    "aria_label": "46082 respostas, 7466 reposts, 31094 curtidas, 1574 items salvos, 16477239 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/2002159893177098407",
    "datetime": "2025-12-19T21:18:17.000Z",
    "text": "Now the coverup is out in the open. This is far from over.\n\nEveryone involved will have to answer for this. Pam Bondi, Kash Patel, whole admin.\n\nProtecting a bunch of rapists and pedophiles because they have money, power, and connections.\n\nBondi should resign tonight.",
    "subtext": "Epstein Files: 119-page grand jury document entirely redacted — MSNow",
    "has_video": false,
    "image_count": 0,
    "answers": 8848,
    "reposts": 37370,
    "likes": 235420,
    "saves": 4779,
    "views": 9357246,
    "aria_label": "8848 respostas, 37370 reposts, 235420 curtidas, 4779 items salvos, 9357246 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/2001446138285531447",
    "datetime": "2025-12-17T23:56:52.000Z",
    "text": "Like I said: view all political developments for the rest of the week in light of the fact that the Epstein Files are supposed to be released on Friday.\n\nHouse Republicans just suddenly cancelled Congressional session Friday and are sending everyone home Thursday evening.",
    "subtext": "NEW: Congress is giving itself an early holiday break.\n\nHouse GOP leadership is cancelling Friday votes, letting members skip town tomorrow afternoon instead.",
    "has_video": false,
    "image_count": 1,
    "answers": 1090,
    "reposts": 9565,
    "likes": 44921,
    "saves": 1387,
    "views": 2158181,
    "aria_label": "1090 respostas, 9565 reposts, 44921 curtidas, 1387 items salvos, 2158181 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/2001412728448000425",
    "datetime": "2025-12-17T22:02:33.000Z",
    "text": "Reminder that the Epstein Files are supposed to be released on Friday and every political development that you see between now until then should be viewed with that in mind.",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "answers": 1926,
    "reposts": 26547,
    "likes": 183618,
    "saves": 3457,
    "views": 3535351,
    "aria_label": "1926 respostas, 26547 reposts, 183618 curtidas, 3457 items salvos, 3535351 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/2001373303542563083",
    "datetime": "2025-12-17T16:57:28.000Z",
    "text": "“I have not lost control of the House” sounds like a guy who has definitely lost control of the House",
    "subtext": "Asked Speaker Johnson if he’s lost control of the House after another discharge petition succeeds — this one on health care at the hands of swing-district Republicans.\n\n“I have not lost control of the House,” he told me",
    "has_video": true,
    "image_count": 0,
    "answers": 749,
    "reposts": 3972,
    "likes": 35567,
    "saves": 418,
    "views": 763299,
    "aria_label": "749 respostas, 3972 reposts, 35567 curtidas, 418 items salvos, 763299 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/2001371211985748284",
    "datetime": "2025-12-17T12:59:56.000Z",
    "text": "Bloop!",
    "subtext": "Alexandria Ocasio-Cortez leads JD Vance 51%-49% in hypothetical 2028 poll — Verasight",
    "has_video": false,
    "image_count": 1,
    "answers": 12363,
    "reposts": 4608,
    "likes": 95969,
    "saves": 1611,
    "views": 6690414,
    "aria_label": "12363 respostas, 4608 reposts, 95969 curtidas, 1611 items salvos, 6690414 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/1999534408806564049",
    "datetime": "2025-12-12T05:49:42.000Z",
    "text": "Good!",
    "subtext": "JUST IN Chandler City Council votes 5-0 to reject Sinema-backed AI data center. \"It doesn't fit\" in Chandler, mayor says after 2 hours of public comment. x.com/brahmresnik/st…",
    "has_video": false,
    "image_count": 0,
    "answers": 416,
    "reposts": 1125,
    "likes": 13862,
    "saves": 122,
    "views": 764511,
    "aria_label": "416 respostas, 1125 reposts, 13862 curtidas, 122 items salvos, 764511 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/1992039604925399379",
    "datetime": "2025-11-21T16:15:38.000Z",
    "text": "Guess this didn’t work out the way you thought it would. ",
    "subtext": "Here’s the new face of the Democrat party — a literal communist — on his way to the White House to be schooled by President Trump. x.com/FoxNews/status…",
    "has_video": false,
    "image_count": 0,
    "answers": 3335,
    "reposts": 6805,
    "likes": 144052,
    "saves": 2060,
    "views": 6747627,
    "aria_label": "3335 respostas, 6805 reposts, 144052 curtidas, 2060 items salvos, 6747627 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/1990867231006470406",
    "datetime": "2025-11-17T21:08:27.000Z",
    "text": "This is how I feel about it.\n\nI loathe machine politics and got to office defeating an incumbent who got in that way.\n\nHowever there are quite a few problems with choosing to grind the entire House to a halt to force all 435 members across the country to do a rushed vote on this one individual instance (of many, mind you!).\n\n1. Why is it that this objection wasn’t brought up until now? The author had no problem when Bill Posey did it, or even earlier this year when a member’s account was tweeting post mortem for an election. The standard of this resolution is unevenly applied and choosing to enforce it via privileged resolution for some but not others does open legitimate questions of rationale or motivation. Why not care about this for them, but care about it now? This question has not been answered.\n\n2. This is why the Ethics Committee exists. Establishing this process as precedent will mean all 435 members of the House will be forced to vote on a slew of individual member indiscretions determined by political convenience of whoever is in the majority. I do not think it is the best use of my constituents’ time to sort through the details of every individual matter of a person acting out of accordance with the esteem of the office once a week for a floor vote under rushed circumstances. The House has an investigatory structure for this for a reason. If there was a complaint filed with Ethics or an investigation buried and then ignored, I’d understand. But that’s not the case here.\n\n3. These specific kinds of resolutions can ONLY be executed on a partisan basis because the mechanism of seeking privilege on this can only move forward with GOP leadership’s blessing. That means partisan enforcement and I do not want to open the door to that. Make it nonpartisan or don’t bother - that’s why the Ethics Committee is structured the way it is.\n\n4. This resolution was dropped on a fly out day to begin voting on a fly in day, giving people no time to review the details of the matter while they are home in district on a weekend. On a matter of local politics that nobody had familiarity with. People are genuinely not familiar with the details of this surprise vote because this is the kind of thing brought to Ethics precisely to investigate and confirm details.",
    "subtext": "\"Pointing it out\" is fine, that's why the good Lord in her infinite wisdom invented Twitter. What I'd ask Members of Congress contemplating this course of action is- does your colleague's behavior rise to the level that you must personally force the whole House to vote on it? x.com/jonfavs/status…",
    "has_video": false,
    "image_count": 0,
    "answers": 638,
    "reposts": 503,
    "likes": 3976,
    "saves": 583,
    "views": 2209519,
    "aria_label": "638 respostas, 503 reposts, 3976 curtidas, 583 items salvos, 2209519 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/1987700013326016912",
    "datetime": "2025-11-10T01:53:07.000Z",
    "text": "The average monthly SNAP benefit is $177 a person.\n\nThe average ACA benefit is up to $550 a person/mo.\n\nPeople want us to hold the line for a reason. This is not a matter of appealing to a base. It’s about people’s lives.\n\nWorking people want leaders whose word means something.",
    "subtext": null,
    "has_video": false,
    "image_count": 0,
    "answers": 10448,
    "reposts": 11354,
    "likes": 79074,
    "saves": 1325,
    "views": 2965783,
    "aria_label": "10448 respostas, 11354 reposts, 79074 curtidas, 1325 items salvos, 2965783 visualizações"
  },
  {
    "permalink": "https://x.com/AOC/status/1986240609145778406",
    "datetime": "2025-11-06T00:45:34.000Z",
    "text": "It was an honor to break bread with our Mayor-elect \n@ZohranKMamdani\n over some of the best momos Jackson Heights has to offer.  \n\nFrom childcare to rent, New York should be affordable and safe for working families. Let’s get to work! ",
    "subtext": "A busy first day as your Mayor-elect: early morning interviews, transition announcements and meetings. More to say on all of it tomorrow. \n\nBut a highlight was lunch with my Congresswoman @AOC at Laliguras Bistro in Jackson Heights.",
    "has_video": false,
    "image_count": 3,
    "answers": 5217,
    "reposts": 3030,
    "likes": 36017,
    "saves": 674,
    "views": 1648352,
    "aria_label": "5217 respostas, 3030 reposts, 36017 curtidas, 674 items salvos, 1648352 visualizações"
  }
]